# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'vim'
brew 'openssh'
brew 'z'
brew 'curl'
brew 'wget'
brew 'zsh'

# Media
brew 'optipng'
brew 'svgo'

# Development
brew 'imagemagick'
brew 'asdf'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'java'
cask 'kap'
cask 'slack'
cask 'steam'
cask 'visual-studio-code'
cask 'iterm2'
cask 'rectangle'
cask 'zoomus'

# A11y
cask 'contraste'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Twitterrific', id: 1289378661
mas 'Constrast', id: 1254981365
mas 'ColorSlurp', id: 1287239339
