# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'exa'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'helix'
brew 'htop'
brew 'imagemagick'
brew 'mas' # Mac App Store manager
brew 'micro'
brew 'nats-server'
brew 'nats-streaming-server'
brew 'neovim'
brew 'openssh'
brew 'optipng'
brew 'qmk'
brew 'ranger'
brew 'starship'
brew 'svgo'
brew 'tmux'
brew 'tmuxinator'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yqrashawn/goku/goku'
brew 'z'
brew 'zsh'

# Apps
cask 'caffeine' # keep your machine awake
cask 'contraste'
cask 'dash' # quick documentation searches
cask 'discord'
cask 'firefox'
cask 'glance' # Quicklook
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'imageoptim'
cask 'iterm2'
cask 'java'
cask 'kap' # screen recordings to video or gif
cask 'karabiner-elements' # for caps-lock as hyper modifier + esc
cask 'keycastr'
cask 'meetingbar' # show upcoming events and click to join meetings
cask 'middle' # ex. three finger tap for middle click
cask 'monodraw'
cask 'numi' # lovely little notebook calculator
cask 'qmk-toolbox'
cask 'rocket' # slack-like emoji anywhere
cask 'signal'
cask 'slack'
cask 'steam'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Development

# Mac App Store
mas 'Xcode', id: 497799835
mas 'Reeder 4', id: 1449412482 # RSS reader
mas 'Dato', id: 1470584107 # Better menu bar calendar app

