# Binaries
brew 'asdf'
brew 'awk'
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'direnv'
brew 'eza'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'helix'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'openssh'
brew 'pipx'
brew 'ripgrep'
brew 'ruff'
brew 'shellcheck'
brew 'shfmt'
brew 'starship'
brew 'taplo'
brew 'terraform-ls'
brew 'tmux'
brew 'tombi'
brew 'tree-sitter'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yaml-language-server'
brew 'yazi'
brew 'yq'
brew 'z'
brew 'zk'
brew 'zsh'
brew 'zsh-autosuggestions'

# Apps
cask 'caffeine' # keep your machine awake
cask 'discord'
cask 'docker'
cask 'ghostty'
cask 'git-credential-manager'
cask 'glance-chamburr' # Quicklook
cask 'google-chrome'
cask 'keycastr'
cask 'meetingbar' # show upcoming events and click to join meetings
cask 'middle' # ex. three finger tap for middle click
cask 'muteme'
cask 'raycast'
cask 'rocket' # slack-like emoji anywhere
cask 'shottr'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'Xcode', id: 497799835
mas 'Dato', id: 1470584107 # Better menu bar calendar app
